{
  "Achilles": {
    "projectMetaData": {
      "projectId": "Achilles",
      "mockupImg": "/project/Achilles.png",
      "webColor": "bg-[#7F3E0A]/20",
      "name": "Achilles",
      "techStack": ["Next.js", "Tailwind CSS" , "Shadcn UI","Typescript" , "Rest Api"],
      "site": "https://achilles-frontend.vercel.app/",
      "github": "https://github.com/naren4488/achilles-frontend",
      "projectInfo": "Achilles is my freelance work project , its a e-commerce website. It features three main components: user-facing frontend, backend for API management, and an admin panel for managing orders, products, and users. It includes essential functionalities like cart management, and order placement. The app is deployed using Vercel, with separate URLs for the frontend, and admin panel."
    }
    
  },
  "SwiftEats": {
    "projectMetaData": {
      "projectId": "SwiftEats",
      "mockupImg": "/project/swiftEats.png",
      "webColor": "bg-[#7F3E0A]/20",
      "name": "SwiftEats",
      "techStack": ["React", "MongoDB" , "Express.js" , "Node.js"],
      "site": "https://swifteats-frontend.onrender.com",
      "github": "https://github.com/kshipraDewat/SwiftEats",
      "projectInfo": "SwiftEats is a full-stack MERN (MongoDB, Express, React, Node.js) project for a food delivery website. It features three main components: user-facing frontend, backend for API management, and an admin panel for managing orders, menus, and users. It includes essential functionalities like food browsing, cart management, and order placement. The app is deployed using Render, with separate URLs for the frontend, backend, and admin panel."
    }
    
  },
  "Teerex": {
    "projectMetaData": {
      "projectId": "Teerex",
      "mockupImg": "/project/teerex.png",
      "webColor": "bg-[#8FE070]/25",
      "name": "Teerex",
      "techStack": ["React", "Tailwind CSS", "Typescript"],
      "site": "https://teerex-93dh.onrender.com",
      "github": "https://github.com/kshipraDewat/TEEREX",
      "projectInfo": "Teerex is a frontend e-commerce website built using React, TypeScript, and Tailwind CSS. The project is designed to allow users to browse and filter T-shirts based on criteria like size and category. It also includes a search functionality and a shopping cart for adding products. The project utilizes API calls to display product details dynamically and employs the Vite build tool for faster development and optimization. It showcases skills in frontend web development, UI design, and state management."
    }
  },
  "Admin Dashboard": {
    "projectMetaData": {
      "projectId": "Admin Dashboard",
      "mockupImg": "/project/AdminDashboard.png",
      "webColor": "bg-[#f0f8ff]",
      "name": "Admin Dashboard",
      "techStack": ["React", "Tailwind CSS", "JavaScript"],
      "site": "https://admindasboard.onrender.com",
      "github": "https://github.com/kshipraDewat/AdminDasboard",
      "projectInfo": "The Admin Dashboard is a frontend project for dynamic admin management tool built using React, Tailwind CSS, and JavaScript. It incorporates Recharts for data visualization and Framer Motion for smooth animations. The dashboard is designed to facilitate administrative tasks, such as managing users, viewing data analytics, and tracking performance metrics. It demonstrates proficiency in modern frontend frameworks and tools for building responsive, animated, and interactive interfaces"
    }
  },
  "ChatterBox": {
    "projectMetaData": {
      "projectId": "ChatterBox",
      "mockupImg": "/project/Chatterbox.png",
      "webColor": "bg-[#F5F8FD]",
      "name": "ChatterBox",
      "techStack": ["React", "Tailwind CSS", "Javascript","Socket.io", "Daisy Ui"],
      "site": "https://chatterbox-pfp3.onrender.com",
      "github": "https://github.com/kshipraDewat/ChatterBox",
      "projectInfo": "ChatterBox is a real-time chat web application that leverages React.js for a dynamic user interface, Tailwind CSS and DaisyUI for responsive and customizable design, JavaScript for core functionality, and Socket.IO for instant, bidirectional communication, providing users with a seamless and engaging messaging experience across various devices."
    }
  },
  "Bellavita": {
    "projectMetaData": {
      "projectId": "Bellavita",
      "mockupImg": "/project/bellavita.png",
      "webColor": "bg-[#F5F8FD]",
      "name": "Bellavita",
      "techStack": ["React", "Tailwind CSS", "Javascript","Context Api"],
      "site": "https://magical-arithmetic-f4b254.netlify.app",
      "github": "https://github.com/kshipraDewat/bellavita",
      "projectInfo": "Developed a responsive e-commerce website clone inspired by Bellavita using React.js and Tailwind CSS, featuring product browsing and cart. Leveraged Context API for seamless state management. Designed an intuitive, user interface with reusable components for scalability and deployed via Netlify for optimized performance."
    }
  }


}
